{
  "branches": [
    {
      "name": "Information Technology",
      "id": "IT",
      "icon": "project-diagram",
      "color": "#2196F3",
      "gradientColors": [
        "#2196F3",
        "#64B5F6"
      ],
      "description": "Software development, networking, and data management",
      "semesters": [
        {
          "id": 3,
          "name": "Semester 3",
          "subjectsCount": 6,
          "credits": 29,
          "subjects": [
            {
              "name": "Discrete Mathematics",
              "course_code": 106301,
              "credits": 4,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "Use mathematically correct terminology and notation.",
                  "Construct correct direct and indirect proofs.",
                  "Use division into cases in a proof.",
                  "Use counterexamples.",
                  "Apply logical reasoning to solve a variety of problems."
                ],
                "learningOutcomes": [
                  "For a given logic sentence express it in terms of predicates, quantifiers, and logical connectives.",
                  "For a given problem, derive the solution using deductive logic and prove the solution based on logical inference.",
                  "For a given mathematical problem, classify its algebraic structure.",
                  "Evaluate Boolean functions and simplify expressions using the properties of Boolean algebra",
                  "Develop the given problem as graph networks and solve with techniques of graph theory."
                ],
                "courseContent": "## Module 1: Lecture 6\n- Sets, Relation and Function: Operations and Laws of Sets, Cartesian Products, Binary Relation, Partial Ordering Relation, Equivalence Relation, Image of a Set, Sum and Product of Functions, Bijective functions, Inverse and Composite Function, Size of a Set, Finite and infinite Sets, Countable and uncountable Sets, Cantor’s diagonal argument and The Power Set theorem, Schroeder-Bernstein theorem.\n\n## Module 2: Lecture 8\n- Principles of Mathematical Induction: The Well-Ordering Principle, Recursive definition, The Division algorithm: Prime Numbers, The Greatest Common Divisor: Euclidean Algorithm, The Fundamental Theorem of Arithmetic.\n- Basic counting techniques-inclusion and exclusion, pigeon-hole principle, permutation and combination.\n\n## Module 3: Lecture 8\n- Propositional Logic: Syntax, Semantics, Validity and Satisfiability, Basic Connectives and Truth Tables, Logical Equivalence: The Laws of Logic, Logical Implication, Rules of Inference, The use of Quantifiers. Proof Techniques: Some Terminology, Proof Methods and Strategies, Forward Proof, Proof by Contradiction, Proof by Contraposition, Proof of Necessity and Sufficiency.\n\n## Module 4: Lecture 8\n- Algebraic Structures and Morphism: Algebraic Structures with one Binary Operation, Semi Groups, Monoids, Groups, Congruence Relation and Quotient Structures, Free and Cyclic Monoids and Groups, Permutation Groups, Substructures, Normal Subgroups, Algebraic Structures with two Binary Operation, Rings, Integral Domain and Fields. Boolean Algebra and Boolean Ring, Identities of Boolean Algebra, Duality, Representation of Boolean Function, Disjunctive and Conjunctive Normal Form\n\n## Module 5: Lecture 10\n- Graphs and Trees: Graphs and their properties, Degree, Connectivity, Path, Cycle, Sub Graph, Isomorphism, Eulerian and Hamiltonian Walks, Graph Coloring, Coloring maps, Planar Graphs, Coloring Vertices, Coloring Edges, List Coloring, Perfect Graph, definition properties and Example, rooted trees, trees and sorting, weighted trees and prefix codes, Bi-connected component and Articulation Points, Shortest distances.",
                "referenceBooks": [
                  "Kenneth H. Rosen, Discrete Mathematics and its Applications, Tata McGraw –Hill",
                  "Susanna S. Epp, Discrete Mathematics with Applications,4th edition, Wadsworth Publishing Co.Inc.",
                  "C L Liu and D P Mohapatra, Elements of Discrete Mathematics A Computer Oriented Approach, 3rd Edition by, Tata McGraw –Hill."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Data Structure and Algorithms",
              "course_code": 100304,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "To impart the basic concepts of data structures and algorithms.",
                  "To understand concepts about searching and sorting techniques",
                  "To understand basic concepts about stacks, queues, lists trees and graphs.",
                  "To enable them to write algorithms for solving problems with the help of fundamental data structures"
                ],
                "learningOutcomes": [
                  "For a given algorithm student will able to analyze the algorithms to determine the time and computation complexity and justify the correctness.",
                  "For a given Search problem (Linear Search and Binary Search) student will able to implement it.",
                  "For a given problem of Stacks, Queues and linked list student will able to implement it and analyze the same to determine the time and computation complexity.",
                  "Student will able to write an algorithm Selection Sort, Bubble Sort, Insertion Sort, Quick Sort, Merge Sort, Heap Sort and compare their performance in term of Space and Time complexity.",
                  "Student will able to implement Graph search and traversal algorithms and determine the time and computation complexity."
                ],
                "courseContent": "## Module 1: Lecture 4\n- Introduction: Basic Terminologies: Elementary Data Organizations, Data Structure Operations: insertion, deletion, traversal etc.; Analysis of an Algorithm, Asymptotic Notations, Time-Space trade off.\n\n## Module 2: Lecture 10\n- Stacks and Queues: ADT Stack and its operations: Algorithms and their complexity analysis, Applications of Stacks: Expression Conversion and evaluation – corresponding algorithms and complexity analysis. ADT queue, Types of Queue: Simple Queue, Circular Queue, Priority Queue; Operations on each Type of Queues: Algorithms and their analysis.\n\n## Module 3: Lecture 6\n- Linked Lists: Singly linked lists: Representation in memory, Algorithms of several operations: Traversing, Searching, Insertion into, Deletion from linked list; Linked representation of Stack and Queue, Header nodes, doubly linked list: operations on it and algorithmic analysis; Circular Linked Lists: all operations their algorithms and the complexity analysis.\n\n## Module 4: Lecture 12\n- Searching, Sorting and Hashing: Linear Search and Binary Search Techniques and their complexityanalysis Objective and properties of different sorting algorithms: Selection Sort, Bubble Sort, Insertion Sort, Quick Sort, Merge Sort, Heap Sort; Performance and Comparison among all the methods, Hashing.\n\n## Module 5: Lecture 8\n- Trees: Basic Tree Terminologies, Different types of Trees: Binary Tree, Threaded Binary Tree, Binary Search Tree, AVLTree; Tree operations on each of the trees and their algorithms with complexity analysis. Applications of Binary Trees. B Tree, B+ Tree: definitions, algorithms andanalysis. Graph: Basic Terminologies and Representations, Graph search and traversal algorithms and complexity analysis.",
                "referenceBooks": [
                  "\"Fundamentals of Data Structures”, Illustrated Edition by Ellis Horowitz, SartajSahni, Computer SciencePress.",
                  "\"Data Structures and Program Design In C\", 2/E by Robert L. Kruse , Bruce P. Leung.",
                  "\"Data Structures\" by Schaum's Outlines.",
                  "\"Algorithms, Data Structures, and Problem Solving with C++\", Illustrated Edition by Mark Allen Weiss, Addison-Wesley Publishing Company.",
                  "\"How to Solve it by Computer\", 2nd Impression by R.G. Dromey, Pearson Education."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Digital Electronics",
              "course_code": 100305,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "Understand working of logic families and logic gates.",
                  "Design and implement Combinational and Sequential logic circuits.",
                  "Understand the process of Analog to Digital conversion and Digital to Analog conversion.",
                  "Be able to use Programmable logic devices to implement the given logical problem."
                ],
                "learningOutcomes": [
                  "At the end of this course, students will demonstrate the ability to:"
                ],
                "courseContent": "## Module 1: Lecture 7 hrs.\n- Fundamentals of Digital Systems and logic families: Digital signals, digital circuits, AND, OR, NOT, NAND, NOR and Exclusive-OR operations, Boolean algebra, examples of IC gates, number systems-binary, signed binary, octal hexadecimal number, binary arithmetic, one’s and two’s complements arithmetic, codes, error detecting and correcting codes, characteristics of digital ICs, digital logic families, TTL, Schottky TTL and CMOS logic, interfacing CMOS and TTL, Tri - state logic.\n\n## Module 2: Lecture: 7 hrs.\n- Combinational Digital Circuits: Standard representation for logic functions K-map representation, simplification of logic functions using K-map, minimization of logical functions. Don’t care conditions, Multiplexer, DeMultiplexer/Decoders, Adders, Subtractors, BCD arithmetic, carry look ahead adder, serial adder, ALU, elementary ALU design, popular MSI chips, digital comparator, parity checker/generator, code converters, priority encoders, decoders/drivers for display devices, Q-M method of function realization.\n\n## Module 3: Lecture: 7 hrs.\n- Sequential circuits and systems: A 1-bit memory, the circuit properties of Bistable latch, the clocked SR flip flop, J- K, T and D types flip flops, application of flip flops, shift registers, applications of shift registers, serial to parallel converter, parallel to serial converter, ring counter, sequence generator, ripple (Asynchronous) counters, synchronous counters, counters design using flip flops, special counter ICs, asynchronous sequential counters, applications of counters.\n\n## Module 4: Lecture: 7 hrs.\n- A/D and D/A Converters: Digital to analog converters: weighted resistor/converter, R-2RLadder D/A converter, specifications for D/A converters, examples of D/A converter ICs, sample and hold circuit, analog to digital converters: quantization and encoding, parallel comparator A/D converter, successive approximation A/D converter, counting A/D converter, dual slope A/D converter, A/D converter using Voltage to frequency and voltage to time conversion, specifications of A/D converters, example of A/D converter ICs.\n\n## Module 5: Lecture 7 hrs.\n- Semiconductor memories and Programmable logic devices: Memory organization and operation, expanding memory size, classification and characteristics of memories, sequential memory, read only memory (ROM), read and write memory(RAM), content addressable memory (CAM), charge de coupled device memory (CCD), commonly used memory chips, ROM as a PLD, Programmable logic array (PLA), Programmable array logic (PAL), complex Programmable logic devices (CPLDs), Field Programmable Gate Array (FPGA).",
                "referenceBooks": [
                  "R. P. Jain, \"Modern Digital Electronics\", McGraw Hill Education, 2009.",
                  "M. M. Mano, \"Digital logic and Computer design\", Pearson Education India, 2016.",
                  "A. Kumar, \"Fundamentals of Digital Circuits\", Prentice Hall India, 2016."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Object Oriented Programming using C++",
              "course_code": 100313,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "To impart the basic concepts of Object Oriented Programming.",
                  "To understand concepts about Classes and Data Abstraction",
                  "To understand basic concepts about Inheritance.",
                  "To enable them to write algorithms for solving problems using object oriented approach."
                ],
                "learningOutcomes": [
                  "An understanding of the concepts of inheritance and polymorphism.",
                  "An ability to overload operators in C++",
                  "An understanding of the difference between function overloading and function overriding",
                  "An ability to incorporate exception handling in object-oriented programs",
                  "An ability to use template classes.",
                  "An ability to write object-oriented programs of moderate complexity in C++"
                ],
                "courseContent": "## Module 1: Lecture: 3\nIntroduction to C++ : Object Oriented Technology, Advantages of OOP, Input- output in C++, Tokens, Keywords, Identifiers, Data Types C++, Derives data types. The void data type, Type Modifiers, Typecasting, Constant, Operator, Precedence of Operators, Strings.\n\n## Module 2: Lecture: 6\nControl Structures and Functions: Decision making statements like if-else, Nested if-else, goto, break, continue, switch case, Loop statement like for loop, nested for loop, while loop, do-while loop. Parts of Function, User- defined Functions, Value- Returning Functions, void Functions, Value Parameters, Function overloading, Virtual Functions.\n\n## Module 3: Lecture: 15\nClasses and Data Abstraction : Structure in C++, Class, Build- in Operations on Classes, Assignment Operator and Classes, Class Scope, Reference parameters and Class Objects (Variables), Member functions, Accessor and Mutator Functions, Constructors, default Constructor, Destructors.\n\n## Module 4: Lecture: 10\nOverloading, Templates and Inheritance: Operator Overloading, Function Overloading, Function Templates, Class Templates. Single and Multiple Inheritance, virtual Base class, Abstract Class, Pointer and Inheritance, Overloading Member Function.\n\n## Module 5: Lecture: 11\nPointers, Arrays and Exception Handling: Void Pointers, Pointer to Class, Pointer to Object, Void Pointer, Arrays. The keywords try, throw and catch. Creating own Exception Classes, Exception Handling Techniques (Terminate the Program, Fix the Error and Continue, Log the Error and Continue), Stack Unwinding.",
                "referenceBooks": [
                  "Thinking in C++, Volume 1 & 2 by Bruce Eckel, Chuck Allison, Pearson Education",
                  "Mastering C++, 1/e by Venugopal, Tata McGraw Hill.",
                  "Object Oriented Programming with C++, 3/e by E. Balaguruswamy, Tata McGraw Hill.",
                  "Starting Out with Object Oriented Programming in C++, by Tony Gaddis, Wiley India.",
                  "The C++ Programming language 3/e by Bjarne Stroustrup, Pearson Education.",
                  "C++, How to Programme, 4e, by Deitel, Pearson Education.",
                  "Big C++ by Cay Horstmann, Wiley India.",
                  "C++ Primer, 3e by Stanley B. Lippmann, JoseeLajoie, Pearson Education.",
                  "C++ and Object Oriented Programming Paradigm, 2e by Debasish Jana, PHI.",
                  "Programming with C++, 2/e by Ravichandran, Tata McGraw Hill.",
                  "C++ Programming Black Book by Steven Holzner, Dreamtech Press."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Mathematics -III \n(Differential Calculus)",
              "course_code": 100311,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [],
                "courseContent": "## Module 1 Lecture: 6 hrs.\n- Successive Differentiation, Leibnitz’s Theorem. Limit, Continuity and Differentiability of function for one variable.\n\n## Module 2 Lecture: 8 hrs.\n- Limit, Continuity and Differentiability of function for several variables. Partial Derivatives, Euler’s Theorem for Homogeneous functions, Total derivatives, Change of Variables. Maxima and Minima of Several Variables. Methods of Lagrange Multipliers. Taylor’s and Maclaurin’s Theorem with remainders of several variables.\n\n## Module 3 Lecture: 8 hrs.\n- Vector Calculus: Gradient, Divergence and Curl of a Vector and their Physical Interpretations, Vector Identities. Directional Derivatives. Line, Surface and Volume integrals, Application of Green’s, Stokes and Gauss Divergence Theorem (Without Proof).\n\n## Module 4 Lecture: 6 hrs.\n- First Order Ordinary Differential Equations: Exact, Linear and Bernoulli’s Equations, Euler’s Equations, Equations not of First Degree. Equations Solvable for P, Equations Solvable for Y, Equations Solvable for X and Clairaut’s Type.\n\n## Module 5 Lecture: 8 hrs.\n- Ordinary Differential Equations of Higher Orders: Second Order Linear Differential Equations with Variable Coefficients, Method of Variation of Parameters, Cauchy-Euler Equation; Power Series Solutions; Legendre Polynomials, Bessel Functions of the First Kind and their properties.\n\n## Module 6 Lecture: 6 hrs.\n- Partial Differential Equations – First Order: First Order Partial Differential Equations, Solutions of First Order Linear and Non-Linear PDEs.",
                "referenceBooks": [],
                "assessmentMethods": []
              }
            },
            {
              "name": "TECHNICAL WRITING",
              "course_code": 100314,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "To understand the variety of structure of technical documents",
                  "To convey clearly, cogently and correctly, through written media, the technical aspects of a practice to audiences.",
                  "To recognize and use of the verbal and technical elements necessary for the successful practice of scientific and technical communication",
                  "To work collaboratively and individually to research, to analyze, and to write about, public debates regarding the conduct of science and technology"
                ],
                "learningOutcomes": [
                  "Student should able to demonstrate improved competence in Standard Written English, including grammar, sentence and paragraph structure, coherence and document design (including the use of the visual), and use this knowledge to revise texts.",
                  "Student should identify and practice the stages required to produce competent, professional writing through planning, drafting, revising, and editing.",
                  "It determine and implement the appropriate methods for each technical writing task.",
                  "Students learn to practice the ethical use of sources and the conventions of citation appropriate to each genre."
                ],
                "courseContent": "## Module 1 Lecture 10 hrs.\n- Introduction: Fundamentals of Technical Writing: Need for Clear and Concise Technical Writing, Attributes of Technical Writing, Types of Technical Writing, Benefits of Technical Communication, Technical, Managerial and General Readers, Expressing versus Impressing, Correct use of Noun, Pronoun, Verb, Adjective, Adverbs, Tense and Punctuation.\n\n## Module 2 Lecture 10 hrs.\n- Performing Technical Studies: Types of Technical Studies, General Methodology- Proposing a Project, Gathering Background Information, Designing Test Plans, Performing Experiments, Reporting Results, Writing Strategy: Analysis of Readers, Scope of Writing, Purpose and Objective. Document Options: Document Hierarchy, Report Types and Selection. Elements of Report Writing: Style and Appearance, Writing Presentation, Language Skills, Writing Style: Elements of Technical Communication Style, Recommended Style, Learn to Prepare Effective Illustrations\n\n## Module 3 Lecture 10 hrs.\n- Formal Reports: The Outline and Introduction (Outline, Title, Front Matter, Writing the Introduction), Writing the Body (Writing a Procedure, Describing Mechanism/Machines/Processes, Writing Test Results, Writing the Discussion Section), Closure (Conclusions, Recommendation, References, Abstract, Back Matter, Report Distribution, Saving and Storing Reports). Elements of an Informal Report, Investigation Reports, Service Activity Log, Lab. Reports and Proposals. Typical Memo Reports.\n\n## Module 4 Lecture 10 hrs.\n- Review and Editing: Types of Review and Edit, Review and Editing Methodology, Examples of Reviews. Oral Presentations: Types of Oral Presentations, Preparation, Visual Aids, Impediments to Technical Writing, Maintaining Writing Skills, Measuring Report Results.",
                "referenceBooks": [
                  "“Engineers’ Guide to Technical Writing”, Kenneth G. Budinski, ASM International.",
                  "“Handbook for Technical Writing”, James H. Shelton, NTC Contemporary Press",
                  "“The Technical Writer’s Handbook: Writing With Style and Clarity”, Matt Young, University Science Books"
                ],
                "assessmentMethods": []
              }
            }
          ]
        },
        {
          "id": 4,
          "name": "Semester 4",
          "subjectsCount": 4,
          "credits": 24,
          "subjects": [
            {
              "name": "Formal Language and Automata Theory",
              "course_code": 100406,
              "credits": 4,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "To develop a formal notation for strings, languages, and machines.",
                  "To design finite automata to accept a set of strings of a language.",
                  "To prove that a given language is regular and apply the closure properties of languages.",
                  "To design context-free grammars to generate strings from a context-free language and convert them into normal forms.",
                  "To prove equivalence of languages accepted by Push Down Automata and languages generated by context-free grammars.",
                  "To identify the hierarchy of formal languages, grammars, and machines.",
                  "To distinguish between computability and non-computability and Decidability and undesirability."
                ],
                "learningOutcomes": [],
                "courseContent": "## Module 1: Lecture 10 hrs\n- Introduction: Alphabet, languages and grammars, productions and derivation, Chomsky hierarchy of languages. Regular languages and finite automata: Regular expressions and languages, deterministic finite automata (DFA) and equivalence with regular expressions, nondeterministic finite automata (NFA) and equivalence with DFA, regular grammars and equivalence with finite automata, properties of regular languages, pumping lemma for regular languages, minimization of finite automata.\n\n## Module 2: Lecture 10 hrs\n- Context-free languages and pushdown automata: Context-free grammars (CFG) and Context-free languages (CFL), Chomsky and Greibach normal forms, nondeterministic pushdown automata (PDA) and equivalence with CFG, parse trees, ambiguity in CFG, pumping lemma for context-free languages, deterministic pushdown automata, closure properties of CFLs.\n\n## Module 3: Lecture 2 hrs\n- Context-sensitive languages: Context-sensitive grammars (CSG) and Context-sensitive languages, linear bounded automata and equivalence with CSG.\n\n## Module 4: Lecture 10 hrs\n- Turing machines: The basic model for Turing machines (TM), Turing recognizable (Recursively enumerable) and Turing-decidable (recursive) languages and their closure properties, variants of Turing machines, nondeterministic TMs and equivalence with deterministic TMs, unrestricted grammars and equivalence with Turing machines, TMs as enumerators.\n\n## Module 5: Lecture 8 hrs\n- Undecidability: Church-Turing thesis, universal Turing machine, the universal and diagonalization languages, reduction between languages and Rice’s theorem, undecidable problems about languages.",
                "referenceBooks": [
                  "John E. Hopcroft, Rajeev Motwani and Jeffrey D. Ullman, Introduction to Automata Theory, Languages, and Computation, Pearson Education Asia.",
                  "Harry R. Lewis and Christos H. Papadimitriou, Elements of the Theory of Computation, Pearson Education Asia.",
                  "Dexter C. Kozen, Automata and Computability, Undergraduate Texts in Computer Science, Springer.",
                  "Michael Sipser, Introduction to the Theory of Computation, PWS Publishing.",
                  "John Martin, Introduction to Languages and the Theory of Computation, Tata McGraw Hill."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Computer Organization and Architecture",
              "course_code": 106401,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "How Computer Systems work & the basic principles.",
                  "Instruction Level Architecture and Instruction Execution.",
                  "The current state of art in memory system design.",
                  "How I/O devices are accessed and its principles.",
                  "To provide the knowledge on Instruction Level Parallelism.",
                  "To impart the knowledge on microprogramming.",
                  "Concepts of advanced pipeline techniques."
                ],
                "learningOutcomes": [],
                "courseContent": "## Module 1: Lecture 10\n- Functional blocks of a computer: CPU, memory, input-output subsystems, control unit. Instruction set architecture of a CPU – registers, instruction execution cycle, RTL interpretation of instructions, addressing modes, instruction set. Case study – instruction sets of some common CPUs. Data representation: signed number representation, fixed and floating point representations, character representation. Computer arithmetic – integer addition and subtraction, ripple carry adder, carry look-ahead adder, etc. multiplication – shift-and-add, Booth multiplier, carry save multiplier, etc. Division restoring and non-restoring techniques, floating point arithmetic.\n\n## Module 2: Lecture 14\n- Introduction to x86 architecture. CPU control unit design: hardwired and micro-programmed design approaches. Case study – design of a simple hypothetical CPU. Memory system design: semiconductor memory technologies, memory organization. Peripheral devices and their characteristics: Input-output subsystems, I/O device interface, I/O transfers – program controlled, interrupt driven and DMA, privileged and non-privileged instructions, software interrupts and exceptions. Programs and processes – role of interrupts in process state transitions, I/O device interfaces – SCSI, USB.\n\n## Module 3: Lecture 10\n- Pipelining: Basic concepts of pipelining, throughput and speedup, pipeline hazards. Parallel Processors: Introduction to parallel processors, Concurrent access to memory and cache coherency.\n\n## Module 4: Lecture 6\n- Memory organization: Memory interleaving, concept of hierarchical memory organization, cache memory, cache size vs. block size, mapping functions, replacement algorithms, write policies.",
                "referenceBooks": [
                  "Computer Organization and Design: The Hardware/Software Interface, 5th Edition by David A. Patterson and John L. Hennessy, Elsevier.",
                  "Computer Organization and Embedded Systems, 6th Edition by Carl Hamacher, McGraw Hill Higher Education.",
                  "Computer Architecture and Organization, 3rd Edition by John P. Hayes, WCB/McGraw-Hill.",
                  "Computer Organization and Architecture: Designing for Performance, 10th Edition by William Stallings, Pearson Education.",
                  "Computer System Design and Architecture, 2nd Edition by Vincent P. Heuring and Harry F. Jordan, Pearson Education."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Machine Learning",
              "course_code": 106403,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "To learn the concept of how to learn patterns and concepts from data.",
                  "Design and analyze various machine learning algorithms and their applications in recent trends.",
                  "Evaluate the various factors of machine learning to measure the performance.",
                  "Understand basics of machine learning’s application in recent trends of technology."
                ],
                "learningOutcomes": [],
                "courseContent": "## UNIT 1\n- Introduction: Basic definitions, Linear Algebra, Statistical learning theory, types of learning, hypothesis space and Inductive bias, evaluation and cross-validation, Optimization.\n\n## UNIT 2\n- Statistical Decision Theory, Bayesian Learning (ML, MAP, Bayes estimates, Conjugate priors), Linear Regression, Ridge Regression, Lasso, Principal Component Analysis, Partial Least Squares.\n\n## UNIT 3\n- Linear Classification, Logistic Regression, Linear Discriminant Analysis, Quadratic Discriminant Analysis, Perceptron, Support Vector Machines + Kernels, Artificial Neural Networks + Back Propagation, Decision Trees, Bayes Optimal Classifier, Naive Bayes.\n\n## UNIT 4\n- Hypothesis testing, Ensemble Methods, Bagging, Adaboost Gradient Boosting, Clustering, K-means, K-medoids, Density-based Hierarchical, Spectral.\n\n## UNIT 5\n- Expectation Maximization, GMMs, Learning theory, Intro to Reinforcement Learning, Bayesian Networks.",
                "referenceBooks": [
                  "Machine Learning. Tom Mitchell. First Edition, McGraw-Hill, 1997.",
                  "Introduction to Machine Learning Edition 2, by Ethem Alpaydin.",
                  "J. Shavlik and T. Dietterich (Ed), Readings in Machine Learning, Morgan Kaufmann, 1990.",
                  "P. Langley, Elements of Machine Learning, Morgan Kaufmann, 1995.",
                  "Understanding Machine Learning. Shai Shalev-Shwartz and Shai Ben-David. Cambridge University Press. 2017.",
                  "The Elements of Statistical Learning. Trevor Hastie, Robert Tibshirani, and Jerome Friedman."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Database Management Systems",
              "course_code": 106405,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "To understand the different issues involved in the design and implementation of a database system.",
                  "To study the physical and logical database designs, database modeling, relational, hierarchical, and network models.",
                  "To understand and use data manipulation language to query, update, and manage a database.",
                  "To develop an understanding of essential DBMS concepts such as database security, integrity, concurrency, distributed database, and intelligent database, Client/Server (Database Server), and Data Warehousing.",
                  "To design and build a simple database system and demonstrate competence with the fundamental tasks involved with modeling, designing, and implementing a DBMS."
                ],
                "learningOutcomes": [
                  "For a given query, write relational algebra expressions and optimize the developed expressions.",
                  "For a given specification of the requirement, design the database using E-R method and normalization.",
                  "For a given specification, construct the SQL queries for Open source and Commercial DBMS - MYSQL, ORACLE, and DB2.",
                  "For a given query, optimize its execution using Query optimization algorithms.",
                  "For a given transaction-processing system, determine the transaction atomicity, consistency, isolation, and durability.",
                  "Implement the isolation property, including locking, timestamp-based concurrency control, and Serializability of scheduling."
                ],
                "courseContent": "## Module 1: Lecture 6\n- Database system architecture: Data Abstraction, Data Independence, Data Definition Language (DDL), Data Manipulation Language (DML).\n- Data models: Entity-relationship model, network model, relational and object-oriented data models, integrity constraints, data manipulation operations.\n\n## Module 2: Lecture 10\n- Relational query languages: Relational algebra, Tuple and domain relational calculus, SQL3, DDL and DML constructs.\n- Open source and Commercial DBMS - MYSQL, ORACLE, DB2, SQL server.\n- Relational database design: Domain and data dependency, Armstrong’s axioms, Normal forms, Dependency preservation, Lossless design.\n- Query processing and optimization: Evaluation of relational algebra expressions, Query equivalence, Join strategies, Query optimization algorithms.\n\n## Module 3: Lecture 4\n- Storage strategies: Indices, B-trees, hashing.\n\n## Module 4: Lecture 8\n- Transaction processing: Concurrency control, ACID property, Serializability of scheduling, Locking and timestamp-based schedulers, Multi-version and optimistic Concurrency Control schemes, Database recovery.\n\n## Module 5: Lecture 6\n- Database Security: Authentication, Authorization and access control, DAC, MAC and RBAC models, Intrusion detection, SQL injection.\n\n## Module 6: Lecture 6\n- Advanced topics: Object-oriented and object-relational databases, Logical databases, Web databases, Distributed databases, Data warehousing, and data mining.",
                "referenceBooks": [
                  "Database System Concepts, 6th Edition by Abraham Silberschatz, Henry F. Korth, S. Sudarshan, McGraw-Hill.",
                  "Principles of Database and Knowledge – Base Systems, Vol 1 by J. D. Ullman, Computer Science Press.",
                  "Fundamentals of Database Systems, 5th Edition by R. Elmasri and S. Navathe, Pearson Education.",
                  "Foundations of Databases, Reprint by Serge Abiteboul, Richard Hull, Victor Vianu, Addison-Wesley."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Human Resource Development and Organizational Behaviour",
              "course_code": 100407,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [],
                "courseContent": null,
                "referenceBooks": [],
                "assessmentMethods": []
              }
            }
          ]
        },
        {
          "id": 5,
          "name": "Semester 5",
          "subjectsCount": 6,
          "credits": 16,
          "subjects": [
            {
              "name": "Microprocessor",
              "course_code": 100504,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "Do assembly language programming.",
                  "Do interfacing design of peripherals like I/O, A/D, D/A, timer, etc.",
                  "Develop systems using different microcontrollers."
                ],
                "learningOutcomes": [
                  "Understand the fundamentals of microprocessors and microcontrollers.",
                  "Gain knowledge of the 8051 architecture and instruction set.",
                  "Learn memory and I/O interfacing techniques.",
                  "Understand external communication interfaces like RS232, SPI, I2C, and Bluetooth.",
                  "Implement applications such as LED, LCD, keyboard, and motor interfacing."
                ],
                "courseContent": "## Module 1: Fundamentals of Microprocessors (7 Hours)\n- Introduction to microprocessor architecture, comparison of 8-bit, 16-bit, and 32-bit microcontrollers, embedded systems, and the 8051 family.\n\n## Module 2: The 8051 Architecture (8 Hours)\n- Internal block diagram, CPU, ALU, address, control bus, working registers, SFRs, clock, RESET circuits, memory structures, I/O ports, data and program memory.\n\n## Module 3: Instruction Set and Programming (8 Hours)\n- Addressing modes, instruction syntax, data types, instruction categories (data transfer, arithmetic, logic, branch), assembly and C language programming.\n\n## Module 4: Memory and I/O Interfacing (6 Hours)\n- Memory expansion, control signals, wait states, interfacing peripherals like ADC, DAC, timers, counters.\n\n## Module 5: External Communication Interface (6 Hours)\n- Synchronous & asynchronous communication (RS232, SPI, I2C), introduction to Bluetooth and Zigbee.\n\n## Module 6: Applications (6 Hours)\n- LED, LCD, keyboard interfacing, stepper motor and DC motor control, sensor interfacing.",
                "referenceBooks": [
                  "M. A. Mazidi, J. G. Mazidi, R. D. McKinlay – The 8051 Microcontroller and Embedded Systems, Pearson, 2007.",
                  "K. J. Ayala – 8051 Microcontroller, Delmar Cengage Learning, 2004.",
                  "R. Kamal – Embedded System, McGraw Hill, 2009.",
                  "R. S. Gaonkar – Microprocessor Architecture & Applications, Penram, 1996.",
                  "D. A. Patterson, J. H. Hennessy – Computer Organization and Design.",
                  "D. V. Hall – Microprocessors & Interfacing, McGraw Hill, 1991."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Design Analysis of Algorithm",
              "course_code": 106502,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "Analyze the asymptotic performance of algorithms.",
                  "Write rigorous correctness proofs for algorithms.",
                  "Demonstrate a familiarity with major algorithms and data structures.",
                  "Apply important algorithmic design paradigms and methods of analysis.",
                  "Synthesize efficient algorithms in common engineering design situations."
                ],
                "learningOutcomes": [
                  "Analyze worst-case running times of algorithms based on asymptotic analysis.",
                  "Describe and apply the greedy paradigm.",
                  "Describe and apply the divide-and-conquer paradigm.",
                  "Describe and apply the dynamic programming paradigm.",
                  "Model engineering problems using graph algorithms.",
                  "Analyze randomized algorithms and approximation algorithms."
                ],
                "courseContent": "### Module 1: Lecture 10  \n**Introduction to Analysis of Algorithm**  \n- Asymptotic analysis of complexity bounds (best, average, worst-case behavior)  \n- Performance measurements of Algorithm  \n- Time and space trade-offs  \n- Analysis of recursive algorithms (Substitution method, Recursion tree method, Masters’ theorem)\n\n### Module 2: Lecture 10  \n**Fundamental Algorithmic Strategies**  \n- Brute-Force, Greedy, Dynamic Programming, Branch-and-Bound, Backtracking  \n- Illustrations: Problem-Solving (Bin Packing, Knapsack, TSP)  \n- Heuristics: Characteristics and applications  \n\n### Module 3: Lecture 10  \n**Graph and Tree Algorithms**  \n- Traversal algorithms: Depth First Search (DFS), Breadth First Search (BFS)  \n- Shortest path algorithms, Transitive closure  \n- Minimum Spanning Tree, Topological sorting, Network Flow Algorithm  \n\n### Module 4: Lecture 6  \n**Tractable and Intractable Problems**  \n- Computability of Algorithms  \n- Computability classes (P, NP, NP-complete, NP-hard)  \n- Cook’s theorem, Standard NP-complete problems, Reduction techniques  \n\n### Module 5: Lecture 4  \n**Advanced Topics**  \n- Approximation algorithms  \n- Randomized algorithms  \n- Class of problems beyond NP – P SPACE",
                "referenceBooks": [
                  "Introduction to Algorithms, 4TH Edition, Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein, MITPress/McGraw-Hill.",
                  "Fundamentals of Algorithms – E. Horowitz et al.",
                  "Algorithm Design, 1ST Edition, Jon Kleinberg and Éva Tardos, Pearson.",
                  "Algorithm Design: Foundations, Analysis, and Internet Examples, 2nd Edition, Michael T. Goodrich and Roberto Tamassia, Wiley.",
                  "Algorithms—A Creative Approach, 3RD Edition, Udi Manber, Addison-Wesley."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Professional Skill Development",
              "course_code": 100508,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [],
                "courseContent": "",
                "referenceBooks": [],
                "assessmentMethods": []
              }
            },
            {
              "name": "Compiler Design",
              "course_code": 106501,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "Understand and list the different stages in the process of compilation.",
                  "Identify different methods of lexical analysis.",
                  "Design top-down and bottom-up parsers.",
                  "Identify synthesized and inherited attributes.",
                  "Develop syntax-directed translation schemes.",
                  "Develop algorithms to generate code for a target machine.",
                  "Learn how to design and implement a compiler and study the underlying theories.",
                  "Focus on imperative language compilation."
                ],
                "learningOutcomes": [
                  "Develop a lexical analyzer for a given grammar specification.",
                  "Design top-down and bottom-up parsers for a given parser specification.",
                  "Implement syntax-directed translation schemes.",
                  "Generate code for a target machine."
                ],
                "courseContent": "### Module 1: Lecture 6  \n**Introduction: Phases of compilation and overview.**  \n- Lexical Analysis (Scanner): Regular languages, finite automata, regular expressions  \n- Transition from regular expressions to finite automata  \n- Scanner generator tools (lex, flex)  \n\n### Module 2: Lecture 9  \n**Syntax Analysis (Parser)**  \n- Context-free languages and grammars  \n- Push-down automata  \n- LL(1) grammars and top-down parsing  \n- Operator grammars, LR(0), SLR(1), LR(1), LALR(1)  \n- Bottom-up parsing, ambiguity in grammars  \n- LALR(1) parser generator tools (yacc, bison)  \n\n### Module 3: Lecture 10  \n**Semantic Analysis**  \n- Attribute grammars, syntax-directed definition  \n- Evaluation and flow of attributes in a syntax tree  \n- Symbol Table: Structure, attributes, and management  \n- Run-time environment: Procedure activation, parameter passing, value return, memory allocation, scope  \n\n### Module 4: Lecture 10  \n**Intermediate Code Generation & Optimization**  \n- Translation of different language features  \n- Different types of intermediate representations  \n- Code improvement (Optimization) techniques:  \n  - Control-flow analysis  \n  - Data-flow dependence  \n  - Local and global optimizations  \n  - Loop optimization, peep-hole optimization  \n- Architecture-dependent code improvement:  \n  - Instruction scheduling (pipeline optimization)  \n  - Loop optimization (cache memory efficiency)  \n- Register allocation and target code generation  \n\n### Module 5: Lecture 5  \n**Advanced Topics**  \n- Type systems and data abstraction  \n- Compilation of object-oriented features  \n- Compilation of non-imperative programming languages  \n",
                "referenceBooks": [
                  "Compilers: Principles, Techniques, and Tools by Alfred V. Aho, Ravi Sethi, Jeffrey D. Ullman, Pearson Education.",
                  "Compiler Design by Santanu Chattopadhyay, PHI.",
                  "Modern Compiler Design by Dick Grune, E. Bal, Ceriel J. H. Jacobs, Koen G. Langendoen, Wiley Dreamtech."
                ],
                "assessmentMethods": [
                  "Assignments and quizzes",
                  "Midterm and final exams",
                  "Project-based evaluation",
                  "Presentations and viva"
                ]
              }
            },
            {
              "name": "Operating System",
              "course_code": 106503,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "Learn the fundamentals of Operating Systems.",
                  "Understand the mechanisms of OS to handle processes and threads and their communication.",
                  "Study memory management mechanisms in contemporary OS.",
                  "Gain knowledge on distributed operating system concepts, including architecture, mutual exclusion mechanisms, deadlock detection, and agreement protocols.",
                  "Understand the components and management aspects of concurrency mechanisms.",
                  "Learn to implement simple OS mechanisms."
                ],
                "learningOutcomes": [
                  "Create processes and threads.",
                  "Develop algorithms for process scheduling to optimize CPU utilization, throughput, turnaround time, waiting time, and response time.",
                  "Apply memory management techniques for better utilization and access time improvement.",
                  "Design and implement a file management system.",
                  "Develop I/O management functions in OS as part of a uniform device abstraction for synchronization between CPU and I/O controllers."
                ],
                "courseContent": "### Module 1: Lecture 4  \n**Introduction:**  \n- Concept of Operating Systems  \n- Generations of Operating Systems  \n- Types of Operating Systems  \n- OS Services  \n- System Calls  \n- Structure of OS (Layered, Monolithic, Microkernel)  \n- Concept of Virtual Machine  \n- Case study on UNIX and Windows Operating System  \n\n### Module 2: Lecture 10  \n**Processes & Threads:**  \n- Definition and relationship between processes  \n- Different states of a process  \n- Process state transitions  \n- Process Control Block (PCB)  \n- Context switching  \n- Thread concepts: Types, benefits, multithreading  \n\n**Process Scheduling:**  \n- Scheduling objectives  \n- Types of schedulers  \n- Scheduling criteria: CPU utilization, throughput, turnaround time, waiting time, response time  \n- Scheduling algorithms: Preemptive and non-preemptive (FCFS, SJF, RR)  \n- Multiprocessor scheduling: RM and EDF  \n\n### Module 3: Lecture 5  \n**Inter-process Communication:**  \n- Critical Section, Race Conditions, Mutual Exclusion  \n- Hardware solutions, Strict Alternation, Peterson’s Solution  \n- The Producer-Consumer Problem, Semaphores, Event Counters, Monitors  \n- Message Passing, Classical IPC Problems (Reader-Writer, Dining Philosopher)  \n\n### Module 4: Lecture 5  \n**Deadlocks:**  \n- Definition  \n- Necessary and sufficient conditions for deadlock  \n- Deadlock Prevention and Avoidance  \n- Banker’s Algorithm  \n- Deadlock detection and recovery  \n\n### Module 5: Lecture 8  \n**Memory Management:**  \n- Basics, Logical vs. Physical Addressing  \n- Contiguous Memory Allocation  \n- Paging: Principle, address translation, hardware support  \n- Segmentation: Hardware support, fragmentation, sharing, disadvantages  \n- Virtual Memory: Locality of reference, page fault, working set, dirty page/bit  \n- Page replacement algorithms: Optimal, FIFO, Second Chance (SC), LRU, NRU  \n\n### Module 6: Lecture 6  \n**I/O and File Management:**  \n- I/O Hardware: Devices, Device Controllers, DMA Principles  \n- I/O Software: Goals, interrupt handlers, drivers  \n- Secondary Storage Structure: Disk Storage, Disk Scheduling Algorithms  \n- File Management: Concept of file, access methods, file types, operations, directory structure, file system structure, allocation methods  \n- Disk Management: Disk scheduling (FCFS, SSTF, SCAN, C-SCAN), disk reliability, formatting, boot block  \n",
                "referenceBooks": [
                  "Operating System Concepts Essentials, 9th Edition by Avi Silberschatz, Peter Galvin, Greg Gagne, Wiley Asia Student Edition.",
                  "Operating Systems: Internals and Design Principles, 5th Edition by William Stallings, Prentice Hall of India.",
                  "Operating Systems: A Modern Perspective, 3rd Edition by Gary Nutt, Addison Wesley.",
                  "Understanding the Linux Kernel, 3rd Edition by Daniel P. Bovet, Marco Cesati, O’Reilly and Associates."
                ],
                "assessmentMethods": [
                  "Assignments and quizzes",
                  "Midterm and final exams",
                  "Project-based evaluation",
                  "Practical hands-on assessments"
                ]
              }
            },
            {
              "name": "Seminar",
              "course_code": 106504,
              "credits": 1,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [],
                "courseContent": "",
                "referenceBooks": [],
                "assessmentMethods": []
              }
            }
          ]
        },
        {
          "id": 6,
          "name": "Semester 6",
          "subjectsCount": 4,
          "credits": 12,
          "subjects": [
            {
              "name": "Computer Networks",
              "course_code": 100602,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "To develop an understanding of modern network architectures from a design and performance perspective.",
                  "To introduce the student to the major concepts involved in wide-area networks (WANs), local area networks (LANs), and Wireless LANs (WLANs).",
                  "To provide an opportunity to do network programming.",
                  "To provide WLAN measurement ideas."
                ],
                "learningOutcomes": [
                  "Explain the functions of the different layers of the OSI protocol.",
                  "Draw the functional block diagram of wide-area networks (WANs), local area networks (LANs), and Wireless LANs (WLANs) and describe the function of each block.",
                  "For a given requirement (small scale) of wide-area networks (WANs), local area networks (LANs), and Wireless LANs (WLANs), design it based on the market available components.",
                  "For a given problem related to TCP/IP protocol, develop the network programming.",
                  "Configure DNS, DDNS, TELNET, EMAIL, File Transfer Protocol (FTP), WWW, HTTP, SNMP, Bluetooth, and Firewalls using open-source available software and tools."
                ],
                "courseContent": "## Module 1: Data Communication Components (8 Hours)\n- Representation of data and its flow in Networks\n- Various Connection Topologies, Protocols and Standards\n- OSI model, Transmission Media\n- LAN: Wired LAN, Wireless LANs\n- Connecting LAN and Virtual LAN\n- Techniques for Bandwidth Utilization: Multiplexing - Frequency division, Time division, and Wave division\n- Concepts on Spread Spectrum\n\n## Module 2: Data Link Layer and Medium Access Sub Layer (8 Hours)\n- Error Detection and Error Correction - Fundamentals\n- Block coding, Hamming Distance, CRC\n- Flow Control and Error Control Protocols - Stop and Wait, Go Back - N ARQ, Selective Repeat ARQ\n- Sliding Window, Piggybacking, Random Access, Multiple access protocols - Pure ALOHA, Slotted ALOHA, CSMA/CD, CDMA/CA\n\n## Module 3: Network Layer (8 Hours)\n- Switching, Logical Addressing - IPv4, IPv6\n- Address Mapping - ARP, RARP, BOOTP, and DHCP\n- Delivery, Forwarding, and Unicast Routing Protocols\n\n## Module 4: Transport Layer (4 Hours)\n- Process to Process Communication\n- User Datagram Protocol (UDP), Transmission Control Protocol (TCP)\n- TCP Service Congestion Control\n- Quality of Service, QoS Improving Techniques: Leaky Bucket and Token Bucket Algorithm\n\n## Module 5: Application Layer (4 Hours)\n- Domain Name System (DNS), DDNS, TELNET, EMAIL\n- File Transfer Protocol (FTP), WWW, HTTP, SNMP, Bluetooth\n- Firewalls, Basic Concepts of Cryptography",
                "referenceBooks": [
                  "Data Communication and Networking, 4th Edition, Behrouz A. Forouzan, McGraw-Hill.",
                  "Data and Computer Communication, 8th Edition, William Stallings, Pearson Prentice Hall India."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Software Engineering",
              "course_code": 106601,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [
                  "Introduce the fundamental concepts and principles of Software Engineering.",
                  "Familiarize students with different software development life cycle models.",
                  "Provide knowledge on requirement analysis, software design, testing, and maintenance.",
                  "Enable students to apply software engineering principles to real-world projects.",
                  "Develop the ability to use software engineering tools and techniques effectively."
                ],
                "learningOutcomes": [
                  "Understand and explain different software development methodologies.",
                  "Analyze and document software requirements using standard models.",
                  "Design structured and object-oriented software solutions.",
                  "Apply software testing techniques to ensure software quality.",
                  "Understand software maintenance models and reengineering concepts."
                ],
                "courseContent": "## Module 1: Introduction to Software Engineering (8 Hours)\n- History and evolution of Software Engineering, software crisis, characteristics of software.\n- Brooks’ No Silver Bullet, Software Myths, and Software Development Life Cycles.\n- Software Development Models: Waterfall, Evolutionary, Incremental, Spiral, Agile, and Rational Unified Process.\n\n## Module 2: Requirements Engineering (8 Hours)\n- Importance of Requirement Analysis, User Needs, Software Features, and Requirements.\n- Functional and Nonfunctional Requirements, Enduring vs. Volatile Requirements.\n- Software Requirements Specification (SRS), tools for requirement gathering (Flowcharts, Decision Trees, Decision Tables).\n\n## Module 3: Software Design (8 Hours)\n- Goals and principles of good software design.\n- Design methodologies: Structured vs. Object-Oriented Design.\n- Data-Oriented Software Design, Modularization, Cohesion, Coupling.\n- Design Patterns, Top-Down & Bottom-Up Approaches.\n\n## Module 4: Software Testing (7 Hours)\n- Testing methodologies: Unit Testing, Integration Testing, System Testing.\n- Functional Testing: Boundary Value Analysis, Equivalence Class Partitioning, Decision Table Testing.\n- Structural Testing: Path Testing, Data Flow Testing, Mutation Testing.\n- Debugging techniques, Testing Tools & Standards.\n\n## Module 5: Software Maintenance (5 Hours)\n- Software maintenance processes and models.\n- Reverse Engineering and Reengineering techniques.\n- Regression Testing, Configuration Management, Documentation.\n",
                "referenceBooks": [
                  "R. S. Pressman – Software Engineering: A Practitioner's Approach, McGraw Hill.",
                  "Rajib Mall – Fundamentals of Software Engineering, 4th Edition, PHI.",
                  "G. G. Schulmeyer – Zero Defect Software, McGraw-Hill.",
                  "J. Rumbaugh – Object-Oriented Modeling and Design, Prentice Hall.",
                  "K. K. Aggarwal, Yogesh Singh – Software Engineering, New Age International Publishers."
                ],
                "assessmentMethods": []
              }
            },            
            {
              "name": "Data Mining",
              "course_code": 106603,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [],
                "courseContent": "",
                "referenceBooks": [],
                "assessmentMethods": []
              }
            },
            {
              "name": "Web Technology",
              "course_code": 106609,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [],
                "courseContent": "",
                "referenceBooks": [],
                "assessmentMethods": []
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Computer Science & Engineering",
      "id": "CSE",
      "icon": "code",
      "color": "#FFC107",
      "gradientColors": [
        "#FFC107",
        "#FFD700"
      ],
      "description": "Software development, algorithms, and computer systems",
      "semesters": [
        {
          "id": 3,
          "name": "Semester 3",
          "subjectsCount": 6,
          "credits": 24,
          "subjects": [
            {
              "name": "Analog Electronic Circuits",
              "course_code": 100302,
              "credits": 3,
              "type": "Core Subject",
              "syllabus": {
                "courseObjectives": [
                  "Understand diode circuits and their applications.",
                  "Analyze BJT and MOSFET circuits for amplification and switching.",
                  "Design and analyze operational amplifier-based circuits."
                ],
                "learningOutcomes": [
                  "Apply circuit analysis techniques to electronic circuits.",
                  "Evaluate amplifier performance parameters.",
                  "Implement analog circuit applications using operational amplifiers."
                ],
                "courseContent": "# Course Content\n\n## Unit 1: Diode Circuits\n- PN junction diode, rectifiers, clamping and clipping circuits (6 hrs)\n\n## Unit 2: BJT Circuits\n- Characteristics, small-signal models, biasing, amplifier configurations (8 hrs)\n\n## Unit 3: MOSFET Circuits\n- Structure, switching, amplifier models, gain analysis (6 hrs)\n\n## Unit 4: Operational Amplifiers\n- Differential amplifier, power amplifier, op-amp characteristics (4 hrs)\n\n## Unit 5: Op-Amp Applications\n- Inverting, non-inverting amplifiers, filters, oscillators (8 hrs)\n\n## Unit 6: Nonlinear Applications\n- Comparators, waveform generators, precision rectifiers (10 hrs)",
                "referenceBooks": [
                  "Microelectronic Circuits – A. S. Sedra & K. C. Smith",
                  "Introduction to Operational Amplifier Theory – J. V. Wait",
                  "The Art of Electronics – P. Horowitz & W. Hill"
                ],
                "assessmentMethods": [
                  "Mid-term examination: 30%",
                  "Final examination: 50%",
                  "Assignments and projects: 20%"
                ]
              }
            },
            {
              "name": "Data Structure & Algorithm",
              "course_code": 100304,
              "credits": 3,
              "type": "Core Subject",
              "syllabus": {
                "courseObjectives": [
                  "Understand data structures and their implementations.",
                  "Analyze algorithm complexity and performance.",
                  "Apply sorting, searching, and graph algorithms."
                ],
                "learningOutcomes": [
                  "Implement data structures like stacks, queues, and linked lists.",
                  "Analyze and optimize algorithms for efficiency.",
                  "Solve problems using trees and graphs."
                ],
                "courseContent": "# Course Content\n\n## Unit 1: Introduction\n- Data structure operations, algorithm complexity (7 hrs)\n\n## Unit 2: Stacks and Queues\n- ADT operations, applications, types of queues (7 hrs)\n\n## Unit 3: Linked Lists\n- Single, doubly, and circular linked lists (7 hrs)\n\n## Unit 4: Sorting and Searching\n- Bubble, Quick, Merge, Heap Sort; Binary and Linear Search (7 hrs)\n\n## Unit 5: Trees\n- Binary Trees, AVL Trees, B-Trees, applications (7 hrs)\n\n## Unit 6: Graphs\n- Representation, traversal algorithms (7 hrs)",
                "referenceBooks": [
                  "Data Structures and Algorithms in C++ – Mark Allen Weiss",
                  "Fundamentals of Data Structures – Ellis Horowitz",
                  "How to Solve it by Computer – R. G. Dromey"
                ],
                "assessmentMethods": [
                  "Mid-term examination: 30%",
                  "Final examination: 50%",
                  "Assignments and projects: 20%"
                ]
              }
            },
            {
              "name": "Object Oriented Programming using C++",
              "course_code": 100313,
              "credits": 3,
              "type": "Core Subject",
              "syllabus": {
                "courseObjectives": [
                  "Understand object-oriented programming concepts.",
                  "Implement classes, objects, inheritance, and polymorphism.",
                  "Develop applications using C++."
                ],
                "learningOutcomes": [
                  "Write C++ programs using OOP principles.",
                  "Apply function overloading and templates.",
                  "Implement exception handling and file handling in C++."
                ],
                "courseContent": "# Course Content\n\n## Unit 1: Introduction\n- OOP principles, data types, operators (7 hrs)\n\n## Unit 2: Control Structures and Functions\n- Decision making, loops, function overloading (8 hrs)\n\n## Unit 3: Classes and Data Abstraction\n- Constructors, destructors, member functions (8 hrs)\n\n## Unit 4: Inheritance and Templates\n- Operator overloading, function templates, multiple inheritance (5 hrs)\n\n## Unit 5: Pointers and Arrays\n- Pointers, array handling, file handling (7 hrs)\n\n## Unit 6: Exception Handling\n- Exception classes, handling techniques (7 hrs)",
                "referenceBooks": [
                  "Thinking in C++ – Bruce Eckel",
                  "Object-Oriented Programming with C++ – E. Balaguruswamy",
                  "The C++ Programming Language – Bjarne Stroustrup"
                ],
                "assessmentMethods": [
                  "Mid-term examination: 30%",
                  "Final examination: 50%",
                  "Assignments and projects: 20%"
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Electrical Engineering",
      "id": "EE",
      "icon": "project-diagram",
      "color": "#441752",
      "gradientColors": [
        "#8174A0",
        "#EA888B5"
      ],
      "description": "Energizing systems, crafting dynamic circuits, and powering future.",
      "semesters": [
        {
          "id": 3,
          "name": "Semester 3",
          "subjectsCount": 5,
          "credits": 26,
          "subjects": [
            {
              "name": "Electrical Circuit Analysis",
              "course_code": 100306,
              "credits": 4,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Apply Network Theorem for analysis of electrical circuits",
                  "Obtain the transient and steady-state response of electrical circuits",
                  "Analyze circuits in the Sinusoidal steady-state (Single-phase and three-phase)"
                ],
                "courseContent": "## **Module 1: Network Theorems (10 Hours)**  \nSuperposition theorem, Thevenin theorem, Norton theorem; Maximum power transfer theorem, Reciprocity theorem, Compensation theorem; Analysis with dependent current and voltage sources; Node and Mesh Analysis; Concept of duality and dual networks.\n\n## **Module 2: Solution of First and Second Order Networks (8 Hours)**  \nSolution of first and second order differential equations for series and parallel R-L, R-C, R-L-C circuits; Initial and final conditions in network elements; Forced and free response, time constants; Steady-state and transient state response.\n\n## **Module 3: Sinusoidal Steady State Analysis (8 Hours)**  \nRepresentation of sine function as a rotating phasor; Phasor diagrams, impedances and admittances; AC circuit analysis, effective or RMS values, average power and complex power; Three-phase circuits, mutual coupled circuits; Dot convention in coupled circuits, ideal transformer.\n\n## **Module 4: Electrical Circuit Analysis Using Laplace Transforms (8 Hours)**  \nReview of Laplace Transform; Analysis of electrical circuits using Laplace Transform for standard inputs; Convolution integral, inverse Laplace transform; Transformed network with initial conditions; Transfer function representation, Poles and Zeros; Frequency response (magnitude and phase plots), series and parallel resonances.\n\n## **Module 5: Two Port Network and Network Functions (6 Hours)**  \nTwo port networks, terminal pairs; Relationship of two port variables; Impedance parameters, admittance parameters; Transmission parameters and hybrid parameters; Interconnections of two port networks.",
                "referenceBooks": [
                  "M. E. Van Valkenburg, Network Analysis, Prentice Hall, 2006.",
                  "D. Roy Choudhury, Networks and Systems, New Age International Publications, 1998.",
                  "W. H. Hayt and J. E. Kemmerly, Engineering Circuit Analysis, McGraw Hill Education, 2013.",
                  "C. K. Alexander and M. N. O. Sadiku, Electric Circuits, McGraw Hill Education, 2004."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Analog Electronics Circuits",
              "course_code": 100302,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Understand the characteristics of Transistors",
                  "Design and analyse various rectifier and amplifier circuits",
                  "Design sinusoidal and non-sinusoidal oscillators",
                  "Understand the functioning of OP-AMP and  design OP-AMP based circuits"
                ],
                "courseContent": "## **Module 1: Diode circuits (4 Hours)**  \nP-N junction diode, I-V characteristics of a diode; review of half-wave and full-wave rectifiers, Zener diodes, clamping and clipping circuits.\n\n## **Module 2: BJT circuits (8 Hours)**  \nStructure and I-V characteristics of a BJT; BJT as a switch. BJT as an amplifier: small-signal model, biasing circuits, current mirror; common-emitter, common-base and common-collector amplifiers; Small signal equivalent circuits, high-frequency equivalent circuits.\n\n## **Module 3: MOSFET circuits (8 Hours)**  \nMOSFET structure and I-V characteristics. MOSFET as a switch. MOSFET as an amplifier: small-signal model and biasing circuits, common-source, common-gate and common-drain amplifiers; small signal equivalent circuits - gain, input and output impedances, trans-conductance, high-frequency equivalent circuit.\n\n## **Module 4: Differential, multi-stage and operational amplifiers (8 Hours)**  \nDifferential amplifier; power amplifier; direct coupled multi-stage amplifier; internal structure of an operational amplifier, ideal op-amp, non-idealities in an op-amp (Output offset voltage, input bias current, input offset current, slew rate, gain bandwidth product).\n\n## **Module 5: Linear applications of op-amp (8 Hours)**  \nIdealized analysis of op-amp circuits. Inverting and non-inverting amplifier, differential amplifier, instrumentation amplifier, integrator, active filter, P PI and PID controllers and lead/lag compensator using an op-amp, voltage regulator, oscillators (Wein bridge and phase shift).\n\n## **Module 6: Nonlinear applications of op-amp (6 Hours)**  \nHysteretic Comparator, Zero Crossing Detector, Square-wave and triangular-wave generators. Precision rectifier, peak detector, Monoshot.\n\n## **Analog to Digital Conversion.**",
                "referenceBooks": [
                  "A. S. Sedra and K. C. Smith, Microelectronic Circuits, Oxford University Press, 1998.",
                  "J. V. Wait, L. P. Huelsman and G. A. Korn, Introduction to Operational Amplifier theory and applications,                             McGraw Hill U. S., 1992.",
                  "J. Millman and A. Grabel, Microelectronics, McGraw Hill Education, 1988.",
                  "P. Horowitz and W. Hill, The Art of Electronics, Cambridge University Press, 1989."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Electrical Machines - 1",
              "course_code": 100307,
              "credits": 4,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Understand the concept of magnetic circuits",
                  "Understand operation of DC machines",
                  "Understand the difference operation of different DC machine configuration",
                  "Understand the single phase and three phase transformers circuits"
                ],
                "courseContent": "## **Module 1: Magnetic Fields and Magnetic Circuits (6 Hours)**  \nReview of magnetic circuits - MMF, flux, reluctance, inductance; review of Ampere Law and Biot-Savart Law; Visualization of magnetic fields produced by a bar magnet and a current-carrying coil - through air and through a combination of iron and air; Influence of highly permeable materials on the magnetic flux lines.\n\n## **Module 2: Electromagnetic Force and Torque (9 Hours)**  \nB-H curve of magnetic materials; Flux-linkage vs current characteristic of magnetic circuits; Linear and nonlinear magnetic circuits; Energy stored in the magnetic circuit; Force as a partial derivative of stored energy with respect to the position of a moving element; Torque as a partial derivative of stored energy with respect to the angular position of a rotating element. Examples - Galvanometer coil, relay contact, lifting magnet, rotating element with eccentricity or saliency.\n\n## **Module 3: Transformers (12 Hours)**  \nPrinciple, construction, and operation of single-phase transformers, equivalent circuit, phasor diagram, voltage regulation, losses, and efficiency. Testing - Open circuit and short circuit tests, polarity test, back-to-back test, separation of hysteresis and eddy current losses. Three-phase transformer - construction, types of connection, and their comparative features. Parallel operation of single-phase and three-phase transformers. Autotransformers - Construction, principle, applications, and comparison with two winding transformers. Magnetizing current, effect of nonlinear B-H curve of magnetic core material, harmonics in magnetization current. Phase conversion - Scott connection, three-phase to six-phase conversion. Tap-changing transformers - No-load and on-load tap-changing of transformers. Three-winding transformers. Cooling of transformers.\n\n## **Module 4: DC Machines (8 Hours)**  \nBasic construction of a DC machine, magnetic structure - stator yoke, stator poles, pole-faces or shoes, air gap, and armature core. Visualization of magnetic field produced by the field winding excitation with armature winding open, air gap flux density distribution, flux per pole, induced EMF in an armature coil. Armature winding and commutation - Elementary armature winding, the coil and commutator, lap and wave windings, construction of the commutator, linear commutation. Derivation of back EMF equation, armature MMF wave, derivation of torque equation, armature reaction, air gap flux density distribution with armature reaction.\n\n## **Module 5: DC Machine - Motoring and Generation (7 Hours)**  \nArmature circuit equation for motoring and generation. Types of field excitations - separately excited, shunt, and series. Open circuit characteristics of separately excited DC generator, back EMF with armature reaction, voltage build-up in a shunt generator, critical field resistance, and critical speed. V-I characteristics and torque-speed characteristics of separately excited, shunt, and series motors. Speed control through armature voltage. Losses, load testing, and back-to-back testing of DC machines.",
                "referenceBooks": [
                  "P. S. Bimbhra, Electrical Machinery, Khanna Publishers.",
                  "J. B. Gupta, Theory and Performance of Electrical Machines, S. K. Kataria & Sons.",
                  "A. E. Fitzgerald, C. Kingsley, and S. D. Umans, Electric Machinery, McGraw Hill.",
                  "M. G. Say, Performance and Design of AC Machines, Pitman & Sons."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Electromagnetics Fields",
              "course_code": 100308,
              "credits": 4,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Understand the basic law of Electromagnetism",
                  "To obtain the electric and magnetic fields for simple configurations under static conditions",
                  "Analyse time varying electric and magnetic fields.",
                  "Understand Maxwell's equation in different forms and different media."
                ],
                "courseContent": "## **Module 1: Review of Vector Calculus (6 Hours)**  \nVector algebra - addition, subtraction, components of vectors, scalar and vector multiplications, triple products, three orthogonal coordinate systems (rectangular, cylindrical, and spherical). Vector calculus - differentiation, partial differentiation, integration, vector operator del, gradient, divergence, and curl; integral theorems of vectors. Conversion of a vector from one coordinate system to another.\n\n## **Module 2: Static Electric Field (6 Hours)**  \nCoulomb’s law, Electric field intensity, Electrical field due to point charges. Line, Surface, and Volume charge distributions. Gauss’s law and its applications. Absolute Electric potential, Potential difference, Calculation of potential differences for different configurations. Electric dipole, Electrostatic Energy and Energy density.\n\n## **Module 3: Conductors, Dielectrics, and Capacitance (6 Hours)**  \nCurrent and current density, Ohm’s Law in Point form, Continuity of current, Boundary conditions of perfect dielectric materials. Permittivity of dielectric materials, Capacitance, Capacitance of a two-wire line, Poisson’s equation, Laplace’s equation, Solution of Laplace and Poisson’s equations, Application of Laplace’s and Poisson’s equations.\n\n## **Module 4: Static Magnetic Fields (6 Hours)**  \nBiot-Savart Law, Ampere’s Law, Magnetic flux and magnetic flux density, Scalar and Vector Magnetic potentials. Steady magnetic fields produced by current-carrying conductors.\n\n## **Module 5: Magnetic Forces, Materials, and Inductance (6 Hours)**  \nForce on a moving charge, Force on a differential current element, Force between differential current elements, Nature of magnetic materials, Magnetization and permeability, Magnetic boundary conditions, Magnetic circuits, Inductances, and Mutual inductances.\n\n## **Module 6: Time Varying Fields and Maxwell’s Equations (6 Hours)**  \nFaraday’s law for Electromagnetic induction, Displacement current, Point form of Maxwell’s equations, Integral form of Maxwell’s equations, Motional Electromotive forces, Boundary Conditions.\n\n## **Module 7: Electromagnetic Waves (6 Hours)**  \nDerivation of Wave Equation, Uniform Plane Waves, Maxwell’s equation in Phasor form, Wave equation in Phasor form, Plane waves in free space and in a homogeneous material. Wave equation for a conducting medium, Plane waves in lossy dielectrics, Propagation in good conductors, Skin effect, Poynting theorem.",
                "referenceBooks": [
                  "M. N. O. Sadiku, Elements of Electromagnetics, Oxford University Press.",
                  "W. H. Hayt and J. A. Buck, Engineering Electromagnetics, McGraw Hill.",
                  "J. D. Kraus, Electromagnetics, McGraw Hill.",
                  "D. K. Cheng, Field and Wave Electromagnetics, Pearson."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Engineering Mechanics",
              "course_code": 100310,
              "credits": 4,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Understand the concepts of coordinate systems.",
                  "Analyse three-dimensional motion.",
                  "Understand the concepts of rigid bodies.",
                  "Analyse the free-body diagrams of different arrangements.",
                  "Analyse torsional motion and bending moment."
                ],
                "courseContent": "## **Module 1: Introduction to Vectors and Tensors and Coordinate Systems (5 Hours)**  \nIntroduction to vectors and tensors and coordinate systems; Vector and tensor algebra; Indical notation; Symmetric and anti-symmetric tensors; Eigenvalues and Principal axes.\n\n## **Module 2: Three-Dimensional Rotation (4 Hours)**  \nThree-dimensional rotation: Euler’s theorem, Axis-angle formulation and Euler angles; Coordinate transformation of vectors and tensors.\n\n## **Module 3: Kinematics of Rigid Body (6 Hours)**  \nDefinition and motion of a rigid body; Rigid bodies as coordinate systems; Angular velocity of a rigid body, and its rate of change; Distinction between two- and three-dimensional rotational motion; Integration of angular velocity to find orientation; Motion relative to a rotating rigid body; Five-term acceleration formula.\n\n## **Module 4: Kinetics of Rigid Bodies (5 Hours)**  \nAngular momentum about a point; Inertia tensor: Definition and computation; Principal moments and axes of inertia; Parallel and perpendicular axes theorems; Mass moment of inertia of symmetrical bodies, cylinder, sphere, cone, etc.; Area moment of inertia and Polar moment of inertia; Forces and moments; Newton-Euler’s laws of rigid body motion.\n\n## **Module 5: Free Body Diagram (1 Hour)**  \nFree body diagrams; Examples on modeling of typical supports and joints; Discussion on the kinematic and kinetic constraints they impose.\n\n## **Module 6: General Motion (9 Hours)**  \nExamples and problems; General planar motions; General 3-D motions; Free precession, Gyroscopes, Rolling coin.\n\n## **Module 7: Bending Moment (5 Hours)**  \nTransverse loading on beams; Shear force and bending moment in beams; Analysis of cantilevers, simply supported beams, and overhanging beams; Relationships between loading, shear force, and bending moment; Shear force and bending moment diagrams.\n\n## **Module 8: Torsional Motion (2 Hours)**  \nTorsion of circular shafts; Derivation of torsion equation; Stress and deformation in circular and hollow shafts.\n\n## **Module 9: Friction (3 Hours)**  \nConcept of Friction; Laws of Coulomb friction; Angle of Repose; Coefficient of friction.\n",
                "referenceBooks": [
                  "J. L. Meriam and L. G. Kraige, Engineering Mechanics: Dynamics, Wiley, 2011.",
                  "M. F. Beatty, Principles of Engineering Mechanics, Springer Science & Business Media, 1986."
                ],
                "assessmentMethods": []
              }
            }
          ]
        },
        {
          "id": 4,
          "name": "Semester 4",
          "subjectsCount": 6,
          "credits": 22,
          "subjects": [
            {
              "name": "Biology for Engineers",
              "course_code": 100401,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Describe how biological observations of the 18th Century led to major discoveries.",
                  "Convey that classification per se is not what biology is all about but highlight the underlying criteria, such as morphological, biochemical, and ecological aspects.",
                  "Highlight the concepts of recessiveness and dominance during the passage of genetic material from parent to offspring.",
                  "Convey that all forms of life have the same building blocks, yet their manifestations are as diverse as one can imagine.",
                  "Classify enzymes and distinguish between different mechanisms of enzyme action.",
                  "Identify DNA as a genetic material in the molecular basis of information transfer.",
                  "Analyze biological processes at the reductionistic level.",
                  "Apply thermodynamic principles to biological systems.",
                  "Identify and classify microorganisms."
                ],
                "courseContent": "## **Module 1: Introduction (2 Hours)**  \nImportance of Biology as a scientific discipline; Fundamental differences between science and engineering; Observations in biology and their significance; Historical biological observations leading to major discoveries; Examples from Brownian motion and thermodynamics.\n\n## **Module 2: Classification (3 Hours)**  \nHierarchy of life forms; Principles of classification; Different criteria for classification such as cellular structure, metabolism, excretion, habitat, and taxonomy; Model organisms for biological studies (E.coli, S. cerevisiae, D. melanogaster, C. elegans, A. thaliana, M. musculus).\n\n## **Module 3: Genetics (4 Hours)**  \nMendel’s laws of inheritance; Concept of allele, gene mapping, and interactions; Meiosis and Mitosis in genetics; Dominance and recessiveness; Gene disorders and their implications; Complementation and suppression in genetics.\n\n## **Module 4: Biomolecules (4 Hours)**  \nMolecular basis of life; Structure and function of biomolecules; Sugars, starch, cellulose; Amino acids, proteins; Nucleotides, DNA, RNA; Lipids and their functional roles.\n\n## **Module 5: Enzymes (4 Hours)**  \nEnzyme catalysis; Mechanisms of enzymatic reactions; Enzyme classification and examples; Enzyme kinetics and biochemical parameters; RNA catalysis.\n\n## **Module 6: Information Transfer (4 Hours)**  \nGenetic coding and decoding; DNA structure hierarchy; Genetic code properties; Transcription and translation mechanisms; Complementation and recombination.\n\n## **Module 7: Macromolecular Analysis (5 Hours)**  \nProtein structure and function; Hierarchical organization of proteins; Functional roles of proteins as enzymes, transporters, receptors, and structural elements.\n\n## **Module 8: Metabolism (4 Hours)**  \nThermodynamics in biological systems; Exothermic and endothermic reactions; ATP as an energy currency; Glycolysis, Krebs cycle, and photosynthesis; Energy charge and cellular bioenergetics.\n\n## **Module 9: Microbiology (3 Hours)**  \nStudy of single-celled organisms; Species classification and microbial taxonomy; Microbial ecology; Growth kinetics; Sterilization and media compositions.\n",
                "referenceBooks": [
                  "N. A. Campbell, J. B. Reece, L. Urry, M. L. Cain, and S. A. Wasserman, 'Biology: A Global Approach', Pearson Education Ltd, 2014.",
                  "E. E. Conn, P. K. Stumpf, G. Bruening, and R. H. Doi, 'Outlines of Biochemistry', John Wiley and Sons, 2009.",
                  "D. L. Nelson and M. M. Cox, 'Principles of Biochemistry', W. H. Freeman and Company, 2012.",
                  "G. S. Stent and R. Calendar, 'Molecular Genetics', Freeman and Company, 1978.",
                  "L. M. Prescott, J. P. Harley, and C. A. Klein, 'Microbiology', McGraw Hill Higher Education, 2005."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Digital Electronics",
              "course_code": 100403,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Understand working of logic families and logic gates.",
                  "Design and implement Combinational and Sequential logic circuits.",
                  "Understand the process of Analog to Digital conversion and Digital to Analog conversion.",
                  "Be able to use PLDs to implement the given logical problem."
                ],
                "courseContent": "## **Module 1: Fundamentals of Digital Systems and Logic Families (7 Hours)**  \nDigital signals, digital circuits, AND, OR, NOT, NAND, NOR, and Exclusive-OR operations; Boolean algebra, examples of logic gates, number systems (binary, signed binary, octal, hexadecimal); Binary arithmetic, one’s and two’s complement arithmetic; Codes, error detecting and correcting codes; Characteristics of digital ICs, digital logic families, TTL, Schottky TTL and CMOS logic, interfacing CMOS and TTL, Tri-state logic.\n\n## **Module 2: Combinational Digital Circuits (7 Hours)**  \nStandard representation for logic functions; K-map representation, simplification of logic functions using K-map, minimization of logic functions; Don’t care conditions; Multiplexer, Demultiplexer/Decoders, Adders, Subtractors, BCD arithmetic, carry look-ahead adder, serial adder, ALU, elementary ALU design; Popular MSI chips, digital comparator, parity checker/generator, code converters, priority encoders, decoders/drivers for display devices; Q-M method of function realization.\n\n## **Module 3: Sequential Circuits and Systems (7 Hours)**  \n1-bit memory, circuit properties of bistable latch, clocked SR flip-flop, J-K-T and D-type flip-flops, applications of flip-flops; Shift registers, applications of shift registers, serial-to-parallel converter, parallel-to-serial converter, ring counter, sequence generator; Ripple (asynchronous) counters, synchronous counters, counter design using flip-flops, special counter ICs; Asynchronous sequential circuits, applications of counters.\n\n## **Module 4: A/D and D/A Converters (7 Hours)**  \nDigital-to-analog converters: weighted resistor/converter, R-2R Ladder D/A converter, specifications for D/A converters, examples of D/A converter ICs, sample and hold circuit; Analog-to-digital converters: quantization and encoding, parallel comparator A/D converter, successive approximation A/D converter, counting A/D converter, dual slope A/D converter; A/D converter using voltage-to-frequency and voltage-to-time conversion; Specifications of A/D converters, examples of A/D converter ICs.\n\n## **Module 5: Semiconductor Memories and Programmable Logic Devices (7 Hours)**  \nMemory organization and operation, expanding memory size; Classification and characteristics of memories: sequential memory, read-only memory (ROM), read and write memory (RAM), content-addressable memory (CAM), charge-coupled device memory (CCD); Commonly used memory chips; ROM as a PLD, programmable logic array, programmable array logic, complex programmable logic devices (CPLDs), field-programmable gate array (FPGA).\n",
                "referenceBooks": [
                  "R. P. Jain, 'Modern Digital Electronics', McGraw Hill Education, 2009.",
                  "M. M. Mano, 'Digital Logic and Computer Design', Pearson Education India, 2016.",
                  "A. Kumar, 'Fundamentals of Digital Circuits', Prentice Hall India, 2016."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Electrical and Electronics Measurements",
              "course_code": 103401,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Work on various instruments and equipment used for the measurement of various electrical engineering parameters.",
                  "Analyze and solve a variety of problems and issues in the vast field of electrical measurements.",
                  "Think in terms of innovative ideas to improve existing technology in the field of measurements in terms of accuracy, cost, durability, and user-friendliness."
                ],
                "courseContent": "## **Module 1: Measurement and Error (8 Hours)**  \nMeasurement and Error: Definition, Accuracy and Precision, Significant Figures, Types of Errors. Standards of Measurement: Classification of Standards, Electrical Standards, IEEE Standards. Types of measuring instruments: Ammeter and Voltmeter: Derivation for Deflecting Torque of PMMC, MI (attraction and repulsion types), Electro Dynamometer and Induction type Ammeters and Voltmeters. Energy meters and wattmeter: Construction, Theory, and Principle of operation of Electro-Dynamometer and Induction type wattmeter, compensation, creep, error, testing, Single Phase and Polyphase Induction type Watt-hour meters. Frequency Meters: Vibrating reed type, electrical resonance type, Power Factor Meters.\n\n## **Module 2: Measurement of Resistance, Inductance, and Capacitance (8 Hours)**  \nResistance: Measurement of Low Resistance by Kelvin’s Double Bridge, Measurement of Medium Resistance, Measurement of High Resistance, Measurement of Resistance of Insulating Materials, Portable Resistance Testing set (Megohmmeter), Measurement of Insulation Resistance when Power is ON, Measurement of Resistance of Earth Connections. Inductance: Measurement of Self-Inductance by Ammeter and Voltmeter, and AC Bridges (Maxwell’s, Hay’s, & Anderson Bridge), Measurement of Mutual Inductance by Felici’s Method, and as Self Inductance. Capacitance: Measurement of Capacitance by Ammeter and Voltmeter, and AC Bridges (Owen’s, Schering’s Bridge), Screening of Bridge Components and Wagner Earthing Device.\n\n## **Module 3: Galvanometer and Potentiometer (8 Hours)**  \nGalvanometer (5 Hours): Construction, Theory, and Principle of operation of D’Arsonval, Vibration (Moving Magnet & Moving Coil types), and Ballistic Galvanometer, Influence of Resistance on Damping, Logarithmic decrement, Calibration of Galvanometers, Galvanometer Constants, Measurement of Flux and Magnetic Field using Galvanometers. Potentiometer: Construction, Theory, and Principle of operation of DC Potentiometers (Crompton, Vernier, Constant Resistance, & Deflection Potentiometer), and AC Potentiometers (Drysdale-Tinsley & Gall-Tinsley Potentiometer).\n\n## **Module 4: Current Transformers, Potential Transformers, and Oscilloscope (8 Hours)**  \nCurrent Transformer and Potential Transformer (3 Hours): Construction, Theory, Characteristics, and Testing of CTs and PTs. Electronic Instruments for Measuring Basic Parameters (2 Hours): Amplified DC Meters, AC Voltmeters using Rectifiers. True RMS Voltmeter, Considerations for choosing an Analog Voltmeter, Digital Voltmeters (Block Diagrams only), Q-meter. Oscilloscope (3 Hours): Block Diagrams, Delay Line, Multiple Trace, Oscilloscope Probes, Oscilloscope Techniques, Introduction to Analog and Digital Storage Oscilloscopes, Measurement of Frequency, Phase Angle, and Time Delay using Oscilloscope.\n",
                "referenceBooks": [
                  "Electrical Measurements and Measuring Instruments – Golding & Widdis – 5th Edition, Reem Publication.",
                  "Modern Electronic Instrumentation and Measurement Techniques – Helfrick & Cooper – Pearson Education.",
                  "A Course in Electrical and Electronic Measurements and Instrumentation – A K Sawhney – Dhanpat Rai & Co.",
                  "Electronic Instrumentation – H C Kalsi – 2nd Edition, Tata McGraw Hill.",
                  "Electronic Measurement and Instrumentation – Oliver & Cage – Tata McGraw Hill."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Electrical Machines- 2",
              "course_code": 103402,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Understand the concepts of rotating magnetic fields.",
                  "Understand the operation of AC machines.",
                  "Analyse performance characteristics of AC machines."
                ],
                "courseContent": "## **Module 1: Measurement and Error (8 Hours)**\nMeasurement and Error: Definition, Accuracy and Precision, Significant Figures, Types of Errors. Standards of Measurement: Classification of Standards, Electrical Standards, IEEE Standards. Types of measuring instruments: Ammeter and Voltmeter: Derivation for Deflecting Torque of PMMC, MI (attraction and repulsion types), Electro Dynamometer and Induction type Ammeters and Voltmeters. Energy meters and wattmeter: Construction, Theory, and Principle of operation of Electro-Dynamometer and Induction type wattmeter, compensation, creep, error, testing, Single Phase and Polyphase Induction type Watt-hour meters. Frequency Meters: Vibrating reed type, electrical resonance type, Power Factor Meters.\n\n## **Module 2: Measurement of Resistance, Inductance, and Capacitance (8 Hours)**\nResistance: Measurement of Low Resistance by Kelvin’s Double Bridge, Measurement of Medium Resistance, Measurement of High Resistance, Measurement of Resistance of Insulating Materials, Portable Resistance Testing set (Megohmmeter), Measurement of Insulation Resistance when Power is ON, Measurement of Resistance of Earth Connections. Inductance: Measurement of Self-Inductance by Ammeter and Voltmeter, and AC Bridges (Maxwell’s, Hay’s, & Anderson Bridge), Measurement of Mutual Inductance by Felici’s Method, and as Self Inductance. Capacitance: Measurement of Capacitance by Ammeter and Voltmeter, and AC Bridges (Owen’s, Schering’s Bridge), Screening of Bridge Components and Wagner Earthing Device.\n\n## **Module 3: Galvanometer and Potentiometer (8 Hours)**\nGalvanometer (5 Hours): Construction, Theory, and Principle of operation of D’Arsonval, Vibration (Moving Magnet & Moving Coil types), and Ballistic Galvanometer, Influence of Resistance on Damping, Logarithmic decrement, Calibration of Galvanometers, Galvanometer Constants, Measurement of Flux and Magnetic Field using Galvanometers. Potentiometer: Construction, Theory, and Principle of operation of DC Potentiometers (Crompton, Vernier, Constant Resistance, & Deflection Potentiometer), and AC Potentiometers (Drysdale-Tinsley & Gall-Tinsley Potentiometer).\n\n## **Module 4: Current Transformers, Potential Transformers, and Oscilloscope (8 Hours)**\nCurrent Transformer and Potential Transformer (3 Hours): Construction, Theory, Characteristics, and Testing of CTs and PTs. Electronic Instruments for Measuring Basic Parameters (2 Hours): Amplified DC Meters, AC Voltmeters using Rectifiers. True RMS Voltmeter, Considerations for choosing an Analog Voltmeter, Digital Voltmeters (Block Diagrams only), Q-meter. Oscilloscope (3 Hours): Block Diagrams, Delay Line, Multiple Trace, Oscilloscope Probes, Oscilloscope Techniques, Introduction to Analog and Digital Storage Oscilloscopes, Measurement of Frequency, Phase Angle, and Time Delay using Oscilloscope.",
                "referenceBooks": [
                  "A. E. Fitzgerald and C. Kingsley, 'Electric Machinery', McGraw Hill Education, 2013.",
                  "M. G. Say, 'Performance and design of AC machines', CBS Publishers, 2002.",
                  "P. S. Bimbhra, 'Electrical Machinery', Khanna Publishers, 2011.",
                  "I. J. Nagrath and D. P. Kothari, 'Electric Machines', McGraw Hill Education, 2010.",
                  "A. S. Langsdorf, 'Alternating current machines', McGraw Hill Education, 1984.",
                  "P. C. Sen, 'Principles of Electric Machines and Power Electronics', John Wiley & Sons, 2007."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Mathematics - 3 (Probability and Statstics)",
              "course_code": 103403,
              "credits": 4,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Understand the fundamental concepts of probability, including probability spaces, conditional probability, and independence.",
                  "Analyze discrete and continuous probability distributions and their properties.",
                  "Apply concepts of bivariate distributions, including sums and quotients, conditional densities, and Bayes' rule.",
                  "Calculate measures of central tendency, moments, skewness, kurtosis, and statistical parameters for different probability distributions.",
                  "Perform curve fitting using the method of least squares and conduct hypothesis testing for large and small samples.",
                  "Use statistical tests such as chi-square for goodness of fit and independence of attributes."
                ],
                "courseContent": "## **Module 1: Basic Probability (12 hours)**\nProbability spaces, conditional probability, independence; Discrete random variables, Independent random variables, the multinomial distribution, Poisson approximation to the binomial distribution, infinite sequences of Bernoulli trials, sums of independent random variables; Expectation of Discrete Random Variables, Moments, Variance of a sum, Correlation coefficient, Chebyshev’s Inequality.\n\n## **Module 2: Continuous Probability Distributions (4 hours)**\nContinuous random variables and their properties, distribution functions and densities, normal, exponential and gamma densities.\n\n## **Module 3: Bivariate Distributions (4 hours)**\nBivariate distributions and their properties, distribution of sums and quotients, conditional densities, Bayes' rule.\n\n## **Module 4: Basic Statistics (8 hours)**\nMeasures of Central tendency: Moments, skewness and Kurtosis - Probability distributions: Binomial, Poisson and Normal - evaluation of statistical parameters for these three distributions, Correlation and regression – Rank correlation.\n\n## **Module 5: Applied Statistics (8 hours)**\nCurve fitting by the method of least squares- fitting of straight lines, second degree parabolas and more general curves. Test of significance: Large sample test for single proportion, difference of proportions, single mean, difference of means, and difference of standard deviations.\n\n## **Module 6: Small samples (4 hours)**\nTest for single mean, difference of means and correlation coefficients, test for ratio of variances - Chisquare test for goodness of fit and independence of attributes.",
                "referenceBooks": [
                  "E. Kreyszig, 'Advanced Engineering Mathematics', John Wiley & Sons, 2006.",
                  "P. G. Hoel, S. C. Port and C. J. Stone, 'Introduction to Probability Theory', Universal Book Stall, 2003.",
                  "S. Ross, 'A First Course in Probability', Pearson Education India, 2002.",
                  "W. Feller, 'An Introduction to Probability Theory and its Applications', Vol. 1, Wiley, 1968.",
                  "N. P. Bali and M. Goyal, 'A Textbook of Engineering Mathematics', Laxmi Publications, 2010.",
                  "B. S. Grewal, 'Higher Engineering Mathematics', Khanna Publishers, 2000.",
                  "T. Veerarajan, 'Engineering Mathematics', Tata McGraw-Hill, New Delhi, 2010."
                ],
                "assessmentMethods": []
              }
            },
            {
              "name": "Signals and Systems",
              "course_code": 103404,
              "credits": 3,
              "type": "Theory",
              "syllabus": {
                "courseObjectives": [],
                "learningOutcomes": [
                  "Understand the concepts of continuous time and discrete time systems.",
                  "Analyze systems in the complex frequency domain.",
                  "Understand the sampling theorem and its implications."
                ],
                "courseContent": "## **Module 1: Introduction to Signals and Systems (3 hours)**\nSignals and systems as seen in everyday life, and in various branches of engineering and science. Signal properties: periodicity, absolute integrability, determinism, and stochastic character. Some special signals of importance: the unit step, the unit impulse, the sinusoid, the complex exponential, some special time-limited signals; continuous and discrete-time signals, continuous and discrete amplitude signals. System properties: linearity: additivity and homogeneity, shift invariance, causality, stability, realizability. Examples.\n\n## **Module 2: Behavior of Continuous and Discrete-time LTI Systems (8 hours)**\nImpulse response and step response, convolution, input-output behavior with periodic convergent inputs, cascade interconnections. Characterization of causality and stability of LTI systems. System representation through differential equations and difference equations. State-space representation of systems. State-space analysis, multi-input, multi-output representation. State transition matrix and its role. Periodic inputs to an LTI system, the notion of a frequency response, and its relation to the impulse response.\n\n## **Module 3: Fourier, Laplace, and z-Transforms (10 hours)**\nFourier series representation of periodic signals, waveform symmetries, calculation of Fourier coefficients. Fourier Transform, convolution/multiplication, and their effect in the frequency domain, magnitude and phase response, Fourier domain duality. The Discrete-Time Fourier Transform (DTFT) and the Discrete Fourier Transform (DFT). Parseval's theorem. Review of the Laplace Transform for continuous time signals and systems, system functions, poles, and zeros of system functions and signals, Laplace domain analysis, solution to differential equations and system behavior. The z-Transform for discrete-time signals and systems, system functions, poles, and zeros of systems and sequences, z-domain analysis.\n\n## **Module 4: Sampling and Reconstruction (4 hours)**\nThe Sampling Theorem and its implications. Spectra of sampled signals. Reconstruction: ideal interpolator, zero-order hold, first-order hold. Aliasing and its effects. Relation between continuous and discrete-time systems. Introduction to the applications of signal and system theory: modulation for communication, filtering, feedback control systems.",
                "referenceBooks": [
                  "A. V. Oppenheim, A. S. Willsky, S. H. Nawab, 'Signals and Systems', Prentice Hall India, 1997.",
                  "J. G. Proakis, D. G. Manolakis, 'Digital Signal Processing: Principles, Algorithms, and Applications', Pearson, 2006.",
                  "H. P. Hsu, 'Signals and Systems', Schaum’s Series, McGraw Hill Education, 2010.",
                  "S. Haykin, B. V. Veen, 'Signals and Systems', John Wiley and Sons, 2007.",
                  "A. V. Oppenheim, R. W. Schafer, 'Discrete-Time Signal Processing', Prentice Hall, 2009.",
                  "M. J. Robert, 'Fundamentals of Signals and Systems', McGraw Hill Education, 2007.",
                  "B. P. Lathi, 'Linear Systems and Signals', Oxford University Press, 2009."
                ],
                "assessmentMethods": []
              }
            }
          ]
        }
      ]
    }
  ],
  "metadata": {
    "academicYear": "2024-2025",
    "appName": "Engineering Guru",
    "updatedAt": "2025-03-06"
  }
}